In [1]:
a =  'Swara'
print(type(a))

<class 'str'>

In [2]:
num  =  34
print(type(num))

<class 'int'>

In [3]:
num2  = 34.87
print(type(num2))

<class 'float'>

In [4]:
b  =  True
print(type(b))

<class 'bool'>

In [5]:
l =  [12,87,45,6]
print(type(l))

<class 'list'>

In [6]:
t =  (12,87,45,6 ,  True  , 'Python')
print(type(t))

<class 'tuple'>

In [7]:
s =  {23 ,45,7,67}
print(type(s))

<class 'set'>

In [8]:
info  = {"Name" : ['Prajakta' ,  'sarthak' ,  'Adarsh'] ,  
"Age"  : [23  , 24  , 10]}

In [9]:
print(type(info))

<class 'dict'>

In [10]:
import  pandas as pd

In [11]:
df  =  pd.DataFrame(info)

In [14]:
df

       Name  Age
0  Prajakta   23
1   sarthak   24
2    Adarsh   10

In [12]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

##### Attributes
- shape
- columns
- index
- size
- dtypes
- values

In [13]:
df.shape

(3, 2)

In [15]:
df.size

6

In [16]:
df.dtypes

Name    object
Age      int64
dtype: object

In [18]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [19]:
df.values

array([['Prajakta', 23],
       ['sarthak', 24],
       ['Adarsh', 10]], dtype=object)

In [20]:
df.index

RangeIndex(start=0, stop=3, step=1)

### Methods / functions
-  info()
- head()
- tail()
- sum()
-  sort_values()

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [ ]:
df.head(  )

       Name  Age
0  Prajakta   23
1   sarthak   24
2    Adarsh   10

In [24]:
df.tail(1)

     Name  Age
2  Adarsh   10

In [25]:
def add(x,  y  = 34):
    return  x+y

In [26]:
add(23,  55)

78

In [27]:
add(2)

36

In [28]:
df.sort_index()

       Name  Age
0  Prajakta   23
1   sarthak   24
2    Adarsh   10

In [29]:
df['Name'].value_counts()

Name
Prajakta    1
sarthak     1
Adarsh      1
Name: count, dtype: int64

In [30]:
len(t)

6

##### Create  class Person

In [40]:
class Person:
    def __init__(self  , Name  , Age  , Gender  , Occupation):
        self.name =   Name
        self.age  =  Age
        self.gender  =  Gender
        self.occupation  =  Occupation

In [41]:
# name  =  ' Sunita' ,  age  - 25 ,  gender  = female  ,  occupation =  'DA'
o1  =  Person(Name  =  ' Sunita' ,  Age  = 25 ,  Gender  = 'female'  ,  Occupation =  'DA')

In [42]:
o1

In [43]:
o1.name

' Sunita'

In [44]:
o1.age

25

In [39]:
o1.gender

'female'

In [45]:
o1.occupation

'DA'